       01  WS-TRANS-REC.
           05 WS-TX-ID           PIC X(30).
           05 WS-TX-TYPE         PIC X(15).
           05 WS-TX-AMOUNT       PIC X(30).
           05 WS-TX-FROM         PIC X(30).
           05 WS-TX-TO           PIC X(30).
           05 WS-TX-TS           PIC X(40).