           IDENTIFICATION          DIVISION.
           PROGRAM-ID      TRANS-PROC.COB

           DATA                    DIVISION.

           ENVIRONMENT             DIVISION.

           PROCEDURE               DIVISION.
           